package com.example.android1splashscreenandgame.data;

import com.example.android1splashscreenandgame.data.models.NameModel;

import java.util.ArrayList;

public class NameData {
   public static ArrayList<NameModel> list = new ArrayList<>();

    public static ArrayList<NameModel> getName(){
        list.add(new NameModel("Pepsi","1.", "Coca-Cola (рус. «Кока-Кола») — газированный безалкогольный напиток, производимый компанией Coca-Cola. Первоначально продававшийся как напиток для замены алкоголя и предназначавшийся в качестве патентного лекарства, он был изобретён в конце 19 века Джоном Ститом Пембертоном и был выкуплен бизнесменом Асой Григгсом Кэндлером, чья маркетинговая тактика привела Coca-Cola к доминированию на мировом рынке безалкогольных напитков на протяжении всего 20 века[1]. Название напитка относится к двум его оригинальным ингредиентам: листьям коки и орехам кола (источник кофеина). Нынешняя формула Coca-Cola остаётся коммерческой тайной. Тем не менее, было опубликовано множество описанных рецептов и экспериментальных воссозданий. Напиток вдохновил подражателей и создал целую классификацию безалкогольных напитков: кола."));
        list.add(new NameModel("Coca Cola", "2.", "Coca-Cola (рус. «Кока-Кола») — газированный безалкогольный напиток, производимый компанией Coca-Cola. Первоначально продававшийся как напиток для замены алкоголя и предназначавшийся в качестве патентного лекарства, он был изобретён в конце 19 века Джоном Ститом Пембертоном и был выкуплен бизнесменом Асой Григгсом Кэндлером, чья маркетинговая тактика привела Coca-Cola к доминированию на мировом рынке безалкогольных напитков на протяжении всего 20 века[1]. Название напитка относится к двум его оригинальным ингредиентам: листьям коки и орехам кола (источник кофеина). Нынешняя формула Coca-Cola остаётся коммерческой тайной. Тем не менее, было опубликовано множество описанных рецептов и экспериментальных воссозданий. Напиток вдохновил подражателей и создал целую классификацию безалкогольных напитков: кола.\n" +
                "\n" +
                "Компания Coca-Cola производит концентрат, который затем продаётся лицензированным разливщикам Coca-Cola по всему миру. Разливщики, которые имеют эксклюзивные контракты с компанией на территории, производят готовый продукт в банках и бутылках из концентрата в сочетании с фильтрованной водой и подсластителями. Типичная банка объёмом 350 мл содержит 38 граммов сахара. В Северной Америке вместо сахара используется кукурузный сироп с высоким содержанием фруктозы. Затем разливщики продают, распространяют и продают Coca-Cola в розничных магазинах, ресторанах и торговых автоматах по всему миру. Компания Coca-Cola также продаёт концентрат для газированных фонтанов крупных ресторанов и дистрибьюторов продуктов питания."));
        list.add(new NameModel("Fanta","3.", "Фа́нта — безалкогольный сильногазированный прохладительный напиток с цитрусовым вкусом"));
        list.add(new NameModel("Sprite", "4.", "Sprite — газированный безалкогольный напиток со вкусом лайма и лимона"));
        list.add(new NameModel("Lays","5.", "Lay’s — бренд разнообразных картофельных чипсов, основанный в 1938 году."));
        list.add(new NameModel("Чипсоны", "6.", "Картофельные чипсы со вкусом бекона."));
        list.add(new NameModel("M&m","7.", "шоколадное драже, выпускаемое фирмой Mars LLC"));
        list.add(new NameModel("Alpen Gold", "8.", "Альпен Гольд — бренд кондитерских изделий, созданный Stollwerck AG"));
        list.add(new NameModel("Samsung","9.", "Samsung Electronics Co., Ltd — транснациональная компания по производству электроники"));
        list.add(new NameModel("Apple", "10.", "Apple (МФА: [ˈæp(ə)l], в переводе с англ. — «яблоко») — американская корпорация, производитель персональных и планшетных компьютеров, аудиоплееров, смартфонов, программного обеспечения.\n" +
                "\n" +
                "Один из пионеров в области персональных компьютеров[13] и современных многозадачных операционных систем с графическим интерфейсом. Штаб-квартира — в Купертино, штат Калифорния. Благодаря инновационным технологиям и эстетичному дизайну корпорация Apple создала в индустрии потребительской электроники уникальную репутацию, сравнимую с культом[14].\n" +
                "\n" +
                "Является первой американской компанией, чья капитализация превысила 1,044 трлн долларов США. Это произошло во время торгов акциями компании 10 сентября 2018 года[15]. В тот же день компания стала самой дорогой публичной компанией за всю историю, превысив капитализацию предыдущего рекордсмена — компании PetroChina (1,005 трлн долларов в ноябре 2007 года)[16]. В январе 2022 года Apple стала первой компанией в мире, рыночная капитализация которой достигла 3 триллионов долларов США.[17][18]\n" +
                "\n" +
                "В 2018 году заняла третье место в списке 500 лучших работодателей мира по мнению журнала Forbes[19]."));
        list.add(new NameModel("HP","11.", "Hewlett-Packard — созданная в 1939 году компания — поставщик аппаратного и программного обеспечения"));
        list.add(new NameModel("Lenovo", "12.", "Lenovo Group Limited — китайская транснациональная корпорация"));
        list.add(new NameModel("JBL","13.", "американская компания, производящая акустику и аудиотехнику"));
        list.add(new NameModel("Xiaomi", "14.", "китайская корпорация, основанная Лэй Цзюнем в 2010 году"));
        list.add(new NameModel("Honor","15.", "HONOR — бренд, ранее принадлежавший китайской компании Huawei."));
        list.add(new NameModel("Kinder", "16.", "Kinder — «дети») — яйцо из шоколада с сюрпризом, содержащее внутри игрушку."));
        return list;
    }
}
